SELECT Служащие.ФИО, Служащие.Опыт, Служащие.Пол,
       Служащие.Дата_рождения, Служащие.Колличество_Детей, Служащие.Зарплата
FROM Служащие, Актеры
WHERE Служащие.Театр = '#'
  AND Служащие.Является_Работником = 'True'
  AND Актеры.Id_Служащего = Служащие.Id
  AND Служащие.Опыт >= #
  AND Служащие.Опыт <= #
  AND Служащие.Пол = '#'
  AND EXTRACT(YEAR FROM Служащие.Дата_рождения) = #
  AND Служащие.Колличество_Детей >= #
  AND Служащие.Колличество_Детей <= #
  AND Служащие.Зарплата >= #
  AND Служащие.Зарплата <= #